## Manipulation of DataFrame: How to add rows

In [1]:
import pandas as pd

In [2]:
# List of Tuples(evry tuple is a row)
students = [ ('jack', 34, 'Sydeny' , 'Australia') ,
             ('Riti', 30, 'Delhi' , 'India' ) ,
             ('Vikas', 31, 'Mumbai' , 'India' ) ,
             ('Neelu', 32, 'Bangalore' , 'India' ) ,
             ('John', 16, 'New York' , 'US') ,
             ('Mike', 17, 'las vegas' , 'US')  ]

#Create a DataFrame object
df = pd.DataFrame(students, columns = ['Name' , 'Age', 'City' , 'Country'], 
                  index=['a', 'b', 'c' , 'd' , 'e' , 'f']) 
df

    Name  Age       City    Country
a   jack   34     Sydeny  Australia
b   Riti   30      Delhi      India
c  Vikas   31     Mumbai      India
d  Neelu   32  Bangalore      India
e   John   16   New York         US
f   Mike   17  las vegas         US

In [3]:
df.shape

(6, 4)

### using dataframe.append() and Dictionary

In [4]:
# Pass the row elements as key value pairs to append() function 
modDfObj = df.append({'Name' : 'Sahil' , 'Age' : 22} )
modDfObj

TypeError: Can only append a dict if ignore_index=True

In [5]:
modDfObj = df.append({'Name' : 'Sahil' , 'Age' : 22} , ignore_index=True)
modDfObj

    Name  Age       City    Country
0   jack   34     Sydeny  Australia
1   Riti   30      Delhi      India
2  Vikas   31     Mumbai      India
3  Neelu   32  Bangalore      India
4   John   16   New York         US
5   Mike   17  las vegas         US
6  Sahil   22        NaN        NaN

In [8]:
modDfObj = df.append({'Name' : 'Sahil' , 'Age' : 22,'pincode':123456} , ignore_index=True)
modDfObj

    Name  Age       City    Country   pincode
0   jack   34     Sydeny  Australia       NaN
1   Riti   30      Delhi      India       NaN
2  Vikas   31     Mumbai      India       NaN
3  Neelu   32  Bangalore      India       NaN
4   John   16   New York         US       NaN
5   Mike   17  las vegas         US       NaN
6  Sahil   22        NaN        NaN  123456.0

### dataframe.append() and Series

In [10]:
s = pd.Series(['Raju', 21, 'Bangalore', 'India'] )
s

0         Raju
1           21
2    Bangalore
3        India
dtype: object

In [12]:
# Pass a series in append() to append a row in dataframe  ---#df.columns
modDfObj = df.append(pd.Series(['Raju', 21, 'Bangalore', 'India'],index=['Name','Age','City','Country']), 
                     ignore_index=True)
modDfObj

    Name  Age       City    Country
0   jack   34     Sydeny  Australia
1   Riti   30      Delhi      India
2  Vikas   31     Mumbai      India
3  Neelu   32  Bangalore      India
4   John   16   New York         US
5   Mike   17  las vegas         US
6   Raju   21  Bangalore      India

### Add multiple rows

In [13]:
df.columns

Index(['Name', 'Age', 'City', 'Country'], dtype='object')

In [14]:
s

0         Raju
1           21
2    Bangalore
3        India
dtype: object

In [15]:
pd.Series(['Raju', 21, 'Bangalore', 'India'], index=df.columns )

Name            Raju
Age               21
City       Bangalore
Country        India
dtype: object

In [16]:
# List of series  
listOfSeries = [pd.Series(['Raju', 21, 'Bangalore', 'India'], index=df.columns ) ,
                pd.Series(['Sam', 22, 'Tokyo', 'Japan'], index=df.columns ) ,
                pd.Series(['Rocky', 23, 'Las Vegas', 'US'], index=df.columns ) ]
listOfSeries

[Name            Raju
 Age               21
 City       Bangalore
 Country        India
 dtype: object,
 Name         Sam
 Age           22
 City       Tokyo
 Country    Japan
 dtype: object,
 Name           Rocky
 Age               23
 City       Las Vegas
 Country           US
 dtype: object]

In [17]:
# Pass a list of series to the append() to add multiple rows
modDfObj = df.append(listOfSeries)
modDfObj

    Name  Age       City    Country
a   jack   34     Sydeny  Australia
b   Riti   30      Delhi      India
c  Vikas   31     Mumbai      India
d  Neelu   32  Bangalore      India
e   John   16   New York         US
f   Mike   17  las vegas         US
0   Raju   21  Bangalore      India
1    Sam   22      Tokyo      Japan
2  Rocky   23  Las Vegas         US

In [18]:
modDfObj = df.append(listOfSeries , ignore_index=True)
modDfObj

    Name  Age       City    Country
0   jack   34     Sydeny  Australia
1   Riti   30      Delhi      India
2  Vikas   31     Mumbai      India
3  Neelu   32  Bangalore      India
4   John   16   New York         US
5   Mike   17  las vegas         US
6   Raju   21  Bangalore      India
7    Sam   22      Tokyo      Japan
8  Rocky   23  Las Vegas         US

### Add a row from one dataframe to other datafram

In [19]:
df

    Name  Age       City    Country
a   jack   34     Sydeny  Australia
b   Riti   30      Delhi      India
c  Vikas   31     Mumbai      India
d  Neelu   32  Bangalore      India
e   John   16   New York         US
f   Mike   17  las vegas         US

In [20]:
# List of Tuples
students = [ ('Rahul', 22, 'Sydeny' , 'Australia') ,
             ('Parul', 23, 'Pune' , 'India')  ]

#Create a DataFrame object
df2 = pd.DataFrame(students, columns = ['Name' , 'Age', 'City' , 'Country'], index=['a', 'b']) 
df2

    Name  Age    City    Country
a  Rahul   22  Sydeny  Australia
b  Parul   23    Pune      India

In [22]:
# append df and df2
modDfobj = df.append(df2, ignore_index=True)
modDfobj

    Name  Age       City    Country
0   jack   34     Sydeny  Australia
1   Riti   30      Delhi      India
2  Vikas   31     Mumbai      India
3  Neelu   32  Bangalore      India
4   John   16   New York         US
5   Mike   17  las vegas         US
6  Rahul   22     Sydeny  Australia
7  Parul   23       Pune      India

In [23]:
df2.append(df,ignore_index=True)

    Name  Age       City    Country
0  Rahul   22     Sydeny  Australia
1  Parul   23       Pune      India
2   jack   34     Sydeny  Australia
3   Riti   30      Delhi      India
4  Vikas   31     Mumbai      India
5  Neelu   32  Bangalore      India
6   John   16   New York         US
7   Mike   17  las vegas         US

In [24]:
df2

    Name  Age    City    Country
a  Rahul   22  Sydeny  Australia
b  Parul   23    Pune      India

In [25]:
#i want to add a single record from df2 which is present at index b
df2.loc['b']

Name       Parul
Age           23
City        Pune
Country    India
Name: b, dtype: object

In [26]:
# add row at index b from dataframe dfObj2 to dataframe dfObj
modDfobj = df.append(df2.loc['b'], ignore_index=True)
modDfobj

    Name  Age       City    Country
0   jack   34     Sydeny  Australia
1   Riti   30      Delhi      India
2  Vikas   31     Mumbai      India
3  Neelu   32  Bangalore      India
4   John   16   New York         US
5   Mike   17  las vegas         US
6  Parul   23       Pune      India

## without append how to add rows

In [27]:
df

    Name  Age       City    Country
a   jack   34     Sydeny  Australia
b   Riti   30      Delhi      India
c  Vikas   31     Mumbai      India
d  Neelu   32  Bangalore      India
e   John   16   New York         US
f   Mike   17  las vegas         US

## using loc add row

In [29]:
# Add a new row at index k with values provided in list
df.loc['x'] = ['Smriti', 26, 'Bangalore', 'India']
df

     Name  Age       City    Country
a    jack   34     Sydeny  Australia
b    Riti   30      Delhi      India
c   Vikas   31     Mumbai      India
d   Neelu   32  Bangalore      India
e    John   16   New York         US
f    Mike   17  las vegas         US
g  Smriti   26  Bangalore      India
x  Smriti   26  Bangalore      India

In [30]:
#if index is already present
df.loc['a']

Name            jack
Age               34
City          Sydeny
Country    Australia
Name: a, dtype: object

In [31]:
#at the place of jack we have updated record of Pravin
#its like update operation
df.loc['a']= ['Pravin', 26, 'Pune', 'India']
df

     Name  Age       City Country
a  Pravin   26       Pune   India
b    Riti   30      Delhi   India
c   Vikas   31     Mumbai   India
d   Neelu   32  Bangalore   India
e    John   16   New York      US
f    Mike   17  las vegas      US
g  Smriti   26  Bangalore   India
x  Smriti   26  Bangalore   India

## adding a row using iloc

In [32]:
df

     Name  Age       City Country
a  Pravin   26       Pune   India
b    Riti   30      Delhi   India
c   Vikas   31     Mumbai   India
d   Neelu   32  Bangalore   India
e    John   16   New York      US
f    Mike   17  las vegas      US
g  Smriti   26  Bangalore   India
x  Smriti   26  Bangalore   India

In [33]:
df.iloc[2]

Name        Vikas
Age            31
City       Mumbai
Country     India
Name: c, dtype: object

In [34]:
# Add a new row at index position 2 with values provided in list
df.iloc[2] = ['Mukesh', 22, 'Chennai', 'India']
df

     Name  Age       City Country
a  Pravin   26       Pune   India
b    Riti   30      Delhi   India
c  Mukesh   22    Chennai   India
d   Neelu   32  Bangalore   India
e    John   16   New York      US
f    Mike   17  las vegas      US
g  Smriti   26  Bangalore   India
x  Smriti   26  Bangalore   India

In [39]:
df.iloc[7] = ['Ramesh', 34, 'Chennai', 'India']
df

     Name  Age       City Country
a  Pravin   26       Pune   India
b    Riti   30      Delhi   India
c  Mukesh   22    Chennai   India
d   Neelu   32  Bangalore   India
e    John   16   New York      US
f    Mike   17  las vegas      US
g  Smriti   26  Bangalore   India
x  Ramesh   34    Chennai   India

In [ ]:
#Assignment:
#I want to add entries/rows in between the present dataframe

## Addition of columns

In [40]:
df

     Name  Age       City Country
a  Pravin   26       Pune   India
b    Riti   30      Delhi   India
c  Mukesh   22    Chennai   India
d   Neelu   32  Bangalore   India
e    John   16   New York      US
f    Mike   17  las vegas      US
g  Smriti   26  Bangalore   India
x  Ramesh   34    Chennai   India

In [41]:
df.shape

(8, 4)

In [50]:
d = {}
d

{}

In [51]:
d['name']='python'

In [53]:
d['age']=[23,53,55,76]

In [54]:
d

{'name': 'python', 'age': [23, 53, 55, 76]}

In [49]:
df

     Name  Age       City Country  Number
a  Pravin   26       Pune   India       1
b    Riti   30      Delhi   India       2
c  Mukesh   22    Chennai   India       3
d   Neelu   32  Bangalore   India       4
e    John   16   New York      US       5
f    Mike   17  las vegas      US       6
g  Smriti   26  Bangalore   India       7
x  Ramesh   34    Chennai   India       8

In [55]:
df['Number']=[1,2,3,4,5,6,7,8]

In [56]:
df

     Name  Age       City Country  Number
a  Pravin   26       Pune   India       1
b    Riti   30      Delhi   India       2
c  Mukesh   22    Chennai   India       3
d   Neelu   32  Bangalore   India       4
e    John   16   New York      US       5
f    Mike   17  las vegas      US       6
g  Smriti   26  Bangalore   India       7
x  Ramesh   34    Chennai   India       8

In [58]:
import numpy as np
df['Random']=np.random.random(8)

In [59]:
df

     Name  Age       City Country  Number    Random
a  Pravin   26       Pune   India       1  0.716121
b    Riti   30      Delhi   India       2  0.512375
c  Mukesh   22    Chennai   India       3  0.708398
d   Neelu   32  Bangalore   India       4  0.535974
e    John   16   New York      US       5  0.033916
f    Mike   17  las vegas      US       6  0.651176
g  Smriti   26  Bangalore   India       7  0.546245
x  Ramesh   34    Chennai   India       8  0.852057

In [ ]:
#assignment:
# How to add column in between the dataFrame
# How to change name of column which is already present

## Delete

In [60]:
df

     Name  Age       City Country  Number    Random
a  Pravin   26       Pune   India       1  0.716121
b    Riti   30      Delhi   India       2  0.512375
c  Mukesh   22    Chennai   India       3  0.708398
d   Neelu   32  Bangalore   India       4  0.535974
e    John   16   New York      US       5  0.033916
f    Mike   17  las vegas      US       6  0.651176
g  Smriti   26  Bangalore   India       7  0.546245
x  Ramesh   34    Chennai   India       8  0.852057

In [61]:
# suppose we want to delete a column
del df['Number']

In [62]:
df

     Name  Age       City Country    Random
a  Pravin   26       Pune   India  0.716121
b    Riti   30      Delhi   India  0.512375
c  Mukesh   22    Chennai   India  0.708398
d   Neelu   32  Bangalore   India  0.535974
e    John   16   New York      US  0.033916
f    Mike   17  las vegas      US  0.651176
g  Smriti   26  Bangalore   India  0.546245
x  Ramesh   34    Chennai   India  0.852057

In [63]:
df.pop()

TypeError: pop() missing 1 required positional argument: 'item'

In [64]:
#Return item and drop from frame. Raise KeyError if not found.
df.pop('Random')

a    0.716121
b    0.512375
c    0.708398
d    0.535974
e    0.033916
f    0.651176
g    0.546245
x    0.852057
Name: Random, dtype: float64

In [65]:
df

     Name  Age       City Country
a  Pravin   26       Pune   India
b    Riti   30      Delhi   India
c  Mukesh   22    Chennai   India
d   Neelu   32  Bangalore   India
e    John   16   New York      US
f    Mike   17  las vegas      US
g  Smriti   26  Bangalore   India
x  Ramesh   34    Chennai   India

In [ ]:
#Assignments:
#How to delete a single row
#how to delete collection of rows
#how to delete random rows

## String Operations

In [66]:
s = pd.Series(['Akshay  ','__yogesh','**Akhilesh','$Akshay','  Anuradha  ', '&@ashish','%%Dattaraj','##Monika##'])
s

0        Akshay
1        __yogesh
2      **Akhilesh
3         $Akshay
4      Anuradha
5        &@ashish
6      %%Dattaraj
7      ##Monika##
dtype: object

In [67]:
#Remove leading and trailing characters #by default spaces are removed
s.str.strip()

0        Akshay
1      __yogesh
2    **Akhilesh
3       $Akshay
4      Anuradha
5      &@ashish
6    %%Dattaraj
7    ##Monika##
dtype: object

In [68]:
s.str.strip('*')

0        Akshay
1        __yogesh
2        Akhilesh
3         $Akshay
4      Anuradha
5        &@ashish
6      %%Dattaraj
7      ##Monika##
dtype: object

In [69]:
s.str.strip('_*!~#$@%^& ')

0      Akshay
1      yogesh
2    Akhilesh
3      Akshay
4    Anuradha
5      ashish
6    Dattaraj
7      Monika
dtype: object

In [70]:
s

0        Akshay
1        __yogesh
2      **Akhilesh
3         $Akshay
4      Anuradha
5        &@ashish
6      %%Dattaraj
7      ##Monika##
dtype: object

In [71]:
s= s.str.strip('_*!~#$@%^& ')
s

0      Akshay
1      yogesh
2    Akhilesh
3      Akshay
4    Anuradha
5      ashish
6    Dattaraj
7      Monika
dtype: object

In [72]:
s = pd.Series(['Akshay  ','__yog12esh','**Akh ilesh','$Aks hay','  Anuradha  ', '&@ashish','%%Dat 12taraj','##Moni3ka##'])
s

0         Akshay
1       __yog12esh
2      **Akh ilesh
3         $Aks hay
4       Anuradha
5         &@ashish
6    %%Dat 12taraj
7      ##Moni3ka##
dtype: object

In [73]:
s.str.replace('\d','')

0        Akshay
1        __yogesh
2     **Akh ilesh
3        $Aks hay
4      Anuradha
5        &@ashish
6     %%Dat taraj
7      ##Monika##
dtype: object

In [74]:
s.str.replace('\D','')

0
1    12
2
3
4
5
6    12
7     3
dtype: object

In [75]:
s.str.replace('\w','')

0
1
2     **
3      $
4
5      &@
6     %%
7    ####
dtype: object

In [76]:
s.str.replace('\W','')

0        Akshay
1    __yog12esh
2      Akhilesh
3        Akshay
4      Anuradha
5        ashish
6    Dat12taraj
7       Moni3ka
dtype: object

In [80]:
s = s.str.replace(' ','').str.replace('1','').str.replace('2','').str.replace('3','').str.replace('\W','').str.replace('_','')
s

0      Akshay
1      yogesh
2    Akhilesh
3      Akshay
4    Anuradha
5      ashish
6    Dattaraj
7      Monika
dtype: object

In [83]:
s.str.capitalize()

0      Akshay
1      Yogesh
2    Akhilesh
3      Akshay
4    Anuradha
5      Ashish
6    Dattaraj
7      Monika
dtype: object

In [84]:
['Vis  hal','$Amol 45','shar    ada']

['Vis  hal', '$Amol 45', 'shar    ada']

In [85]:
['vishal 23','amol 34','sharada 21']

['vishal 23', 'amol 34', 'sharada 21']

In [86]:
pd.Series(['vishal 23','amol 34','sharada 21'])

0     vishal 23
1       amol 34
2    sharada 21
dtype: object

In [87]:
df

     Name  Age       City Country
a  Pravin   26       Pune   India
b    Riti   30      Delhi   India
c  Mukesh   22    Chennai   India
d   Neelu   32  Bangalore   India
e    John   16   New York      US
f    Mike   17  las vegas      US
g  Smriti   26  Bangalore   India
x  Ramesh   34    Chennai   India

In [90]:
df.iloc[2]['City']='Mumbai'

/srv/conda/envs/notebook/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [91]:
df

     Name  Age       City Country
a  Pravin   26       Pune   India
b    Riti   30      Delhi   India
c  Mukesh   22    Chennai   India
d   Neelu   32  Bangalore   India
e    John   16   New York      US
f    Mike   17  las vegas      US
g  Smriti   26  Bangalore   India
x  Ramesh   34    Chennai   India

In [96]:
df[2:3]['City']='Mumbai'

/srv/conda/envs/notebook/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [100]:
df.loc['c']['City']='Pune'

/srv/conda/envs/notebook/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [101]:
df

     Name  Age       City Country
a  Pravin   26       Pune   India
b    Riti   30      Delhi   India
c  Mukesh   22     Mumbai   India
d   Neelu   32  Bangalore   India
e    John   16   New York      US
f    Mike   17  las vegas      US
g  Smriti   26  Bangalore   India
x  Ramesh   34    Chennai   India